Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttributeEnumerator.MoveNext Method
 Moves to the next reference model object attribute.
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveNext()
Public Function MoveNext As Boolean
Return Value
Type: Boolean
True if successfully moved to the next reference model object attribute.
Implements
IEnumerator.MoveNext()
See Also
Reference
ReferenceModelObjectAttributeEnumerator Class
Tekla.Structures.Model.Collaboration Namespace